#+title: Canonical correlation analysis for MiCoNE
#+PROPERTY: header-args:python :python /home/dileep/.virtualenvs/math_sci/bin/python :session py :results output :exports both

#+BEGIN_SRC elisp :exports none
(setq org-babel-python-command "/home/dileep/.virtualenvs/math_sci/bin/python")
(lsp-org-babel-enable "python")
#+END_SRC

#+RESULTS:

#+begin_src python
import pandas as pd
import numpy as np

d = pd.DataFrame(np.zeros(10), index=range(1, 11), columns=["Vals"])
print(d + 1)
#+end_src

#+RESULTS:
#+begin_example
    Vals
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
7    1.0
8    1.0
9    1.0
10   1.0
#+end_example

#+begin_src python
print(d)
#+end_src

#+RESULTS:
#+begin_example
    Vals
1    0.0
2    0.0
3    0.0
4    0.0
5    0.0
6    0.0
7    0.0
8    0.0
9    0.0
10   0.0
#+end_example

#+begin_src jupyter-python
print(d + 2)
#+end_src

#+RESULTS:
#+begin_example
Vals
1    2.0
2    2.0
3    2.0
4    2.0
5    2.0
6    2.0
7    2.0
8    2.0
9    2.0
10   2.0
#+end_example
